avrdudes/avr-libc/include/avr/ioavr32da48.h
/* Crystal startup time select bit group configurations*/
typedef enum CLKCTRL_CSUT_enum
{
    CLKCTRL_CSUT_1K_gc             = (CLKCTRL_CSUT_1K_gv << CLKCTRL_CSUT_gp),  /* 1k cycles */
    CLKCTRL_CSUT_16K_gc            = (CLKCTRL_CSUT_16K_gv << CLKCTRL_CSUT_gp),  /* 16k cycles */
    CLKCTRL_CSUT_32K_gc            = (CLKCTRL_CSUT_32K_gv << CLKCTRL_CSUT_gp),  /* 32k cycles */
    CLKCTRL_CSUT_64K_gc            = (CLKCTRL_CSUT_64K_gv << CLKCTRL_CSUT_gp)   /* 64k cycles */
} CLKCTRL_CSUT_t;

/* Frequency select bit group values */
typedef enum CLKCTRL_FRQSEL_VALUES_enum
{
    CLKCTRL_FRQSEL_1M_gv           = 0x00,  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gv           = 0x01,  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gv           = 0x02,  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gv           = 0x03,  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gv           = 0x05,  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gv          = 0x06,  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gv          = 0x07,  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gv          = 0x08,  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gv          = 0x09   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_values_t;

/* Frequency select bit group configurations*/
typedef enum CLKCTRL_FRQSEL_enum
{
    CLKCTRL_FRQSEL_1M_gc           = (CLKCTRL_FRQSEL_1M_gv << CLKCTRL_FRQSEL_gp),  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gc           = (CLKCTRL_FRQSEL_2M_gv << CLKCTRL_FRQSEL_gp),  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gc           = (CLKCTRL_FRQSEL_3M_gv << CLKCTRL_FRQSEL_gp),  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gc           = (CLKCTRL_FRQSEL_4M_gv << CLKCTRL_FRQSEL_gp),  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gc           = (CLKCTRL_FRQSEL_8M_gv << CLKCTRL_FRQSEL_gp),  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gc          = (CLKCTRL_FRQSEL_12M_gv << CLKCTRL_FRQSEL_gp),  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gc          = (CLKCTRL_FRQSEL_16M_gv << CLKCTRL_FRQSEL_gp),  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gc          = (CLKCTRL_FRQSEL_20M_gv << CLKCTRL_FRQSEL_gp),  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gc          = (CLKCTRL_FRQSEL_24M_gv << CLKCTRL_FRQSEL_gp)   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_t;

/* Multiplication factor select bit group values */
typedef enum CLKCTRL_MULFAC_VALUES_enum
{
    CLKCTRL_MULFAC_DISABLE_gv      = 0x00,  /* PLL is disabled */
    CLKCTRL_MULFAC_2x_gv           = 0x01,  /* 2 x multiplication factor */
    CLKCTRL_MULFAC_3x_gv           = 0x02   /* 3 x multiplication factor */
} CLKCTRL_MULFAC_values_t;

/* Multiplication factor select bit group configurations*/
typedef enum CLKCTRL_MULFAC_enum
{
    CLKCTRL_MULFAC_DISABLE_gc      = (CLKCTRL_MULFAC_DISABLE_gv << CLKCTRL_MULFAC_gp),  /* PLL is disabled */
    CLKCTRL_MULFAC_2x_gc           = (CLKCTRL_MULFAC_2x_gv << CLKCTRL_MULFAC_gp),  /* 2 x multiplication factor */
    CLKCTRL_MULFAC_3x_gc           = (CLKCTRL_MULFAC_3x_gv << CLKCTRL_MULFAC_gp)   /* 3 x multiplication factor */
} CLKCTRL_MULFAC_t;

/* Prescaler division select bit group values */
typedef enum CLKCTRL_PDIV_VALUES_enum
{
    CLKCTRL_PDIV_2X_gv             = 0x00,  /* 2X */
    CLKCTRL_PDIV_4X_gv             = 0x01,  /* 4X */
    CLKCTRL_PDIV_8X_gv             = 0x02,  /* 8X */
    CLKCTRL_PDIV_16X_gv            = 0x03,  /* 16X */
    CLKCTRL_PDIV_32X_gv            = 0x04,  /* 32X */
    CLKCTRL_PDIV_64X_gv            = 0x05,  /* 64X */
    CLKCTRL_PDIV_6X_gv             = 0x08,  /* 6X */
    CLKCTRL_PDIV_10X_gv            = 0x09,  /* 10X */
    CLKCTRL_PDIV_12X_gv            = 0x0A,  /* 12X */
    CLKCTRL_PDIV_24X_gv            = 0x0B,  /* 24X */
    CLKCTRL_PDIV_48X_gv            = 0x0C   /* 48X */
} CLKCTRL_PDIV_values_t;

/* Prescaler division select bit group configurations*/
typedef enum CLKCTRL_PDIV_enum
{
    CLKCTRL_PDIV_2X_gc             = (CLKCTRL_PDIV_2X_gv << CLKCTRL_PDIV_gp),  /* 2X */
    CLKCTRL_PDIV_4X_gc             = (CLKCTRL_PDIV_4X_gv << CLKCTRL_PDIV_gp),  /* 4X */
    CLKCTRL_PDIV_8X_gc             = (CLKCTRL_PDIV_8X_gv << CLKCTRL_PDIV_gp),  /* 8X */
    CLKCTRL_PDIV_16X_gc            = (CLKCTRL_PDIV_16X_gv << CLKCTRL_PDIV_gp),  /* 16X */
    CLKCTRL_PDIV_32X_gc            = (CLKCTRL_PDIV_32X_gv << CLKCTRL_PDIV_gp),  /* 32X */
    CLKCTRL_PDIV_64X_gc            = (CLKCTRL_PDIV_64X_gv << CLKCTRL_PDIV_gp),  /* 64X */
    CLKCTRL_PDIV_6X_gc             = (CLKCTRL_PDIV_6X_gv << CLKCTRL_PDIV_gp),  /* 6X */
    CLKCTRL_PDIV_10X_gc            = (CLKCTRL_PDIV_10X_gv << CLKCTRL_PDIV_gp),  /* 10X */
    CLKCTRL_PDIV_12X_gc            = (CLKCTRL_PDIV_12X_gv << CLKCTRL_PDIV_gp),  /* 12X */
    CLKCTRL_PDIV_24X_gc            = (CLKCTRL_PDIV_24X_gv << CLKCTRL_PDIV_gp),  /* 24X */
    CLKCTRL_PDIV_48X_gc            = (CLKCTRL_PDIV_48X_gv << CLKCTRL_PDIV_gp)   /* 48X */
} CLKCTRL_PDIV_t;

/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V4S

/* CCP signature select bit group values */
typedef enum CCP_VALUES_enum
{
    CCP_SPM_gv                     = 0x9D,  /* SPM Instruction Protection */
    CCP_IOREG_gv                   = 0xD8   /* IO Register Protection */
} CCP_values_t;

/* CCP signature select bit group configurations*/
typedef enum CCP_enum
{
    CCP_SPM_gc                     = (CCP_SPM_gv << CPU_CCP_gp),  /* SPM Instruction Protection */
    CCP_IOREG_gc                   = (CCP_IOREG_gv << CPU_CCP_gp)   /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CPUINT - Interrupt Controller
--------------------------------------------------------------------------
*/

/* Interrupt Controller */
typedef struct CPUINT_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t LVL0PRI;  /* Interrupt Level 0 Priority */
    register8_t LVL1VEC;  /* Interrupt Level 1 Priority Vector */
    register8_t reserved_1[12];
} CPUINT_t;


