avrdudes/avr-libc/include/avr/ioavr32da48.h
/* USART0 Signals select bit group values */
typedef enum PORTMUX_USART0_VALUES_enum
{
    PORTMUX_USART0_DEFAULT_gv      = 0x00,  /* TxD: PA0, RxD: PA1, XCK: PA2, XDIR: PA3 */
    PORTMUX_USART0_ALT1_gv         = 0x01,  /* TxD: PA4, RxD: PA5, XCK: PA6, XDIR: PA7 */
    PORTMUX_USART0_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART0_values_t;

/* USART0 Signals select bit group configurations*/
typedef enum PORTMUX_USART0_enum
{
    PORTMUX_USART0_DEFAULT_gc      = (PORTMUX_USART0_DEFAULT_gv << PORTMUX_USART0_gp),  /* TxD: PA0, RxD: PA1, XCK: PA2, XDIR: PA3 */
    PORTMUX_USART0_ALT1_gc         = (PORTMUX_USART0_ALT1_gv << PORTMUX_USART0_gp),  /* TxD: PA4, RxD: PA5, XCK: PA6, XDIR: PA7 */
    PORTMUX_USART0_NONE_gc         = (PORTMUX_USART0_NONE_gv << PORTMUX_USART0_gp)   /* Not connected to any pins */
} PORTMUX_USART0_t;

/* USART1 Signals select bit group values */
typedef enum PORTMUX_USART1_VALUES_enum
{
    PORTMUX_USART1_DEFAULT_gv      = 0x00,  /* TxD: PC0, RxD: PC1, XCK: PC2, XDIR: PC3 */
    PORTMUX_USART1_ALT1_gv         = 0x01,  /* TxD: PC4, RxD: PC5, XCK: PC6, XDIR: PC7 */
    PORTMUX_USART1_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART1_values_t;

/* USART1 Signals select bit group configurations*/
typedef enum PORTMUX_USART1_enum
{
    PORTMUX_USART1_DEFAULT_gc      = (PORTMUX_USART1_DEFAULT_gv << PORTMUX_USART1_gp),  /* TxD: PC0, RxD: PC1, XCK: PC2, XDIR: PC3 */
    PORTMUX_USART1_ALT1_gc         = (PORTMUX_USART1_ALT1_gv << PORTMUX_USART1_gp),  /* TxD: PC4, RxD: PC5, XCK: PC6, XDIR: PC7 */
    PORTMUX_USART1_NONE_gc         = (PORTMUX_USART1_NONE_gv << PORTMUX_USART1_gp)   /* Not connected to any pins */
} PORTMUX_USART1_t;

/* USART2 Signals select bit group values */
typedef enum PORTMUX_USART2_VALUES_enum
{
    PORTMUX_USART2_DEFAULT_gv      = 0x00,  /* TxD: PF0, RxD: PF1, XCK: PF2, XDIR: PF3 */
    PORTMUX_USART2_ALT1_gv         = 0x01,  /* TxD: PF4, RxD: PF5, XCK: -, XDIR: - */
    PORTMUX_USART2_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART2_values_t;

/* USART2 Signals select bit group configurations*/
typedef enum PORTMUX_USART2_enum
{
    PORTMUX_USART2_DEFAULT_gc      = (PORTMUX_USART2_DEFAULT_gv << PORTMUX_USART2_gp),  /* TxD: PF0, RxD: PF1, XCK: PF2, XDIR: PF3 */
    PORTMUX_USART2_ALT1_gc         = (PORTMUX_USART2_ALT1_gv << PORTMUX_USART2_gp),  /* TxD: PF4, RxD: PF5, XCK: -, XDIR: - */
    PORTMUX_USART2_NONE_gc         = (PORTMUX_USART2_NONE_gv << PORTMUX_USART2_gp)   /* Not connected to any pins */
} PORTMUX_USART2_t;

/* USART3  Signals select bit group values */
typedef enum PORTMUX_USART3_VALUES_enum
{
    PORTMUX_USART3_DEFAULT_gv      = 0x00,  /* TxD: PB0, RxD: PB1, XCK: PB2, XDIR: PB3 */
    PORTMUX_USART3_ALT1_gv         = 0x01,  /* TxD: PB4, RxD: PB5, XCK: -, XDIR: - */
    PORTMUX_USART3_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART3_values_t;

/* USART3  Signals select bit group configurations*/
typedef enum PORTMUX_USART3_enum
{
    PORTMUX_USART3_DEFAULT_gc      = (PORTMUX_USART3_DEFAULT_gv << PORTMUX_USART3_gp),  /* TxD: PB0, RxD: PB1, XCK: PB2, XDIR: PB3 */
    PORTMUX_USART3_ALT1_gc         = (PORTMUX_USART3_ALT1_gv << PORTMUX_USART3_gp),  /* TxD: PB4, RxD: PB5, XCK: -, XDIR: - */
    PORTMUX_USART3_NONE_gc         = (PORTMUX_USART3_NONE_gv << PORTMUX_USART3_gp)   /* Not connected to any pins */
} PORTMUX_USART3_t;

/* USART4 Signals select bit group values */
typedef enum PORTMUX_USART4_VALUES_enum
{
    PORTMUX_USART4_DEFAULT_gv      = 0x00,  /* TxD: PE0, RxD: PE1, XCK: PE2, XDIR: PE3 */
    PORTMUX_USART4_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART4_values_t;

/* USART4 Signals select bit group configurations*/
typedef enum PORTMUX_USART4_enum
{
    PORTMUX_USART4_DEFAULT_gc      = (PORTMUX_USART4_DEFAULT_gv << PORTMUX_USART4_gp),  /* TxD: PE0, RxD: PE1, XCK: PE2, XDIR: PE3 */
    PORTMUX_USART4_NONE_gc         = (PORTMUX_USART4_NONE_gv << PORTMUX_USART4_gp)   /* Not connected to any pins */
} PORTMUX_USART4_t;

/* Zero Cross Detector 0 Output select bit group values */
typedef enum PORTMUX_ZCD0_VALUES_enum
{
    PORTMUX_ZCD0_DEFAULT_gv        = 0x00,  /* OUT: PA7 */
    PORTMUX_ZCD0_ALT1_gv           = 0x01   /* OUT: PC7 */
} PORTMUX_ZCD0_values_t;

/* Zero Cross Detector 0 Output select bit group configurations*/
typedef enum PORTMUX_ZCD0_enum
{
    PORTMUX_ZCD0_DEFAULT_gc        = (PORTMUX_ZCD0_DEFAULT_gv << PORTMUX_ZCD0_bp),  /* OUT: PA7 */
    PORTMUX_ZCD0_ALT1_gc           = (PORTMUX_ZCD0_ALT1_gv << PORTMUX_ZCD0_bp)   /* OUT: PC7 */
} PORTMUX_ZCD0_t;

/* Zero Cross Detector 1 Output select bit group values */
typedef enum PORTMUX_ZCD1_VALUES_enum
{
    PORTMUX_ZCD1_DEFAULT_gv        = 0x00,  /* OUT: PA7 */
    PORTMUX_ZCD1_ALT1_gv           = 0x01   /* OUT: PC7 */
} PORTMUX_ZCD1_values_t;

/* Zero Cross Detector 1 Output select bit group configurations*/
typedef enum PORTMUX_ZCD1_enum
{
    PORTMUX_ZCD1_DEFAULT_gc        = (PORTMUX_ZCD1_DEFAULT_gv << PORTMUX_ZCD1_bp),  /* OUT: PA7 */
    PORTMUX_ZCD1_ALT1_gc           = (PORTMUX_ZCD1_ALT1_gv << PORTMUX_ZCD1_bp)   /* OUT: PC7 */
} PORTMUX_ZCD1_t;


/*
--------------------------------------------------------------------------
RSTCTRL - Reset controller
--------------------------------------------------------------------------
*/

/* Reset controller */
typedef struct RSTCTRL_struct
{
    register8_t RSTFR;  /* Reset Flags */
    register8_t SWRR;  /* Software Reset */
    register8_t reserved_1[2];
} RSTCTRL_t;


/*
--------------------------------------------------------------------------
RTC - Real-Time Counter
--------------------------------------------------------------------------
*/

/* Real-Time Counter */
typedef struct RTC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t TEMP;  /* Temporary */
    register8_t DBGCTRL;  /* Debug control */
    register8_t CALIB;  /* Calibration */
    register8_t CLKSEL;  /* Clock Select */
    _WORDREGISTER(CNT);  /* Counter */
    _WORDREGISTER(PER);  /* Period */
    _WORDREGISTER(CMP);  /* Compare */
    register8_t reserved_1[2];
    register8_t PITCTRLA;  /* PIT Control A */
    register8_t PITSTATUS;  /* PIT Status */
    register8_t PITINTCTRL;  /* PIT Interrupt Control */
    register8_t PITINTFLAGS;  /* PIT Interrupt Flags */
    register8_t reserved_2[1];
    register8_t PITDBGCTRL;  /* PIT Debug control */
    register8_t reserved_3[10];
} RTC_t;

